---
kind: type
id: T:Autodesk.Revit.UI.Tab
source: html/bfde6ca7-941b-744c-a91a-2d85bbcff9bf.htm
---
# Autodesk.Revit.UI.Tab

An enumerated type listing static tabs which support addition of panels via the API.

## Syntax (C#)
```csharp
public enum Tab
```